'''Домашнє завдання:
1. Напишіть програму, яка прочитає два рядки тексту з клавіатури і виведе на екран літери, які є одночасно і в першому, і в другому рядку. Наприклад, для рядків «Hello» та «World» на екрані мають бути літери «l» та «o».
2. Напишіть програму, яка згенерує два списки. Один із числами кратними 3, інший із числами кратними 5.
3. Створіть список із числами, які є в обох списках.
Напишіть функцію, яка поверне максимальне число зі списку чисел.
4. Реалізуйте функцію, параметрами якої є два числа та рядок. Повертає вона конкатенацію рядка із сумою чисел.
5. Реалізуйте функцію, яка малює на екрані прямокутник із зірочок «*». Її параметрами будуть цілі числа, які описують довжину та ширину такого прямокутника.
6. Напишіть функцію, яка реалізує лінійний пошук елемента у списку цілих чисел. Якщо такий елемент у списку є, то поверніть індекс, якщо ні, то поверніть число «-1».
7. Напишіть функцію, яка поверне кількість слів у текстовому рядку.'''

# 1. Напишіть програму, яка прочитає два рядки тексту з клавіатури і виведе на екран літери, які є одночасно і в першому, і в другому рядку. Наприклад, для рядків «Hello» та «World» на екрані мають бути літери «l» та «o».
# user_string_1 = input("Enter first word ")
# user_string_2 = input("Enter second word ")
user_string_1 = "Hello"
user_string_2 = "World"
print(set(list(user_string_1)) & set(list(user_string_2)))